app/controllers/api/feeds_controller.rb

SELECT "feeds".* FROM "feeds" ORDER BY "feeds"."id" ASC
---
  def index
    render :json => Feed.all